'use strict'

document.addEventListener('DOMContentLoaded', () => {
    let Lang = localStorage.getItem('lS_Lang');
    TRANSLATE_BD.forEach( item => document.getElementById(`${item.id}`).textContent = `${item[Lang]}`);
    document.getElementById('s_lang').value = (Lang == 'eng') ? 0 : 1; // временная заплатка пока значения языков обазначены цифрами 0=англ, 1=русс. пока не заменена полностью старая функция перевода
    Translate()
});

// document.addEventListener('', () => {})
document.getElementById('s_lang').addEventListener("change", () => {
    let Lang = document.getElementById('s_lang').value;
    Lang = (Lang == 0) ? 'eng' : 'rus'; // временная заплатка пока значения языков обазначены цифрами 0=англ, 1=русс. пока не заменена полностью старая функция перевода
    TRANSLATE_BD.forEach( item => document.getElementById(`${item.id}`).textContent = `${item[Lang]}`);
    localStorage.setItem('lS_Lang', Lang);
    return
});

function Translate() {
    for (let i=1; i<lang_tag_array.length; i++) {
        $("#" + lang_tag_array[i][0]).html(lang_tag_array[i][+$("select#s_lang").val() + 1]);
    }
    if (+$("select#s_lang").val() === 1) {
        $('#l_Sexual').addClass('lang-ru-condensed');
        // $('#l_Origin').addClass('lang-ru-condensed');
        // $('#l_Religi').addClass('lang-ru-extr-cond');
        $('#l_Est-8-Scl').addClass('lang-ru-condensed');
        // $('#l_Est-8-Scl').addClass('lang-ru-conden');

        // $('#cel_Religi').removeClass('col-5');
        // $('#cel_Religi').addClass('col-6');
        // $('#cel_Gender').removeClass('col-7');
        // $('#cel_Gender').addClass('col-6');

        // $('#cel_Setting').removeClass('col-md-3');
        // $('#cel_Setting').addClass('col-md-4');
        // $('#cel_Rules').removeClass('col-md-9');
        // $('#cel_Rules').addClass('col-md-8');

        // $('#cel_Nation').removeClass('col-xl-3');
        // $('#cel_Nation').addClass('col-xl-2');
        // $('#cel_Religi').removeClass('col-xl-3');
        // $('#cel_Religi').addClass('col-xl-4');

        // $('#cel_Gender').removeClass('col-xl-3');
        // $('#cel_Gender').addClass('col-xl-2');
        // $('#cel_Sexual').removeClass('col-xl-3');
        // $('#cel_Sexual').addClass('col-xl-4');

        $('#cel_Est-8-Scl').removeClass('col-xl-6');
        $('#cel_Est-8-Scl').addClass('col-xl-8');
        $('#cel_Chartr').removeClass('col-xl-6');
        $('#cel_Chartr').addClass('col-xl-4');

        $('#cel_Nation_out').removeClass('col-sm-9');
        $('#cel_Nation_out').addClass('col-sm-11');
        $('#cel_Nation_out').removeClass('col-md-9');
        $('#cel_Nation_out').addClass('col-md-10');
        // $('#cel_Nation_out').removeClass('col-lg-6');
        // $('#cel_Nation_out').addClass('col-lg-6');
        // $('#cel_Nation_out').removeClass('col-xxl-5');
        // $('#cel_Nation_out').addClass('col-xxl-6');
        $('#cel_Nation_out').removeClass('col-xxl-5');
        $('#cel_Nation_out').addClass('col-xxl-6');

        $('#cel_Class_out').removeClass('col-lg-5');
        $('#cel_Class_out').addClass('col-lg-6');
        $('#cel_Class_out').removeClass('col-xxl-6');
        $('#cel_Class_out').addClass('col-xxl-5');

        $('#cel_Name_out').removeClass('col-lg-9');
        $('#cel_Name_out').addClass('col-lg-10');
        $('#cel_Name_out').removeClass('col-xxl-6');
        $('#cel_Name_out').addClass('col-xxl-7');

        $('#cel_Strength_out').removeClass('col-md-11');
        $('#cel_Strength_out').addClass('col-md-10');

        $('#cel_Virtue_out').removeClass('col-sm-10');
        $('#cel_Virtue_out').addClass('col-sm-11');
        $('#cel_Virtue_out').removeClass('col-md-9');
        $('#cel_Virtue_out').addClass('col-md-10');
        $('#cel_Virtue_out').removeClass('col-lg-5');
        $('#cel_Virtue_out').addClass('col-lg-6');
        $('#cel_Virtue_out').removeClass('col-xxl-5');
        $('#cel_Virtue_out').addClass('col-xxl-6');

        $('#cel_Hubris_out').removeClass('col-lg-6');
        $('#cel_Hubris_out').addClass('col-lg-5');
        // $('.button-gen').addClass('lang-ru');
    } else if (+$("select#s_lang").val() === 0) {
        // $('.gen-title-header').removeClass('lang-ru');
        $('#l_Sexual').removeClass('lang-ru-condensed');
        // $('#l_Origin').removeClass('lang-ru-condensed');
        // $('#l_Religi').removeClass('lang-ru-extr-cond');
        $('#l_Est-8-Scl').removeClass('lang-ru-condensed');
        // $('#l_Est-8-Scl').removeClass('lang-ru-conden');

        // $('#cel_Religi').removeClass('col-6');
        // $('#cel_Religi').addClass('col-5');
        // $('#cel_Gender').removeClass('col-6');
        // $('#cel_Gender').addClass('col-7');

        // $('#cel_Setting').removeClass('col-md-4');
        // $('#cel_Setting').addClass('col-md-3');
        // $('#cel_Rules').removeClass('col-md-8');
        // $('#cel_Rules').addClass('col-md-9');

        // $('#cel_Nation').removeClass('col-xl-2');
        // $('#cel_Nation').addClass('col-xl-3');
        // $('#cel_Religi').removeClass('col-xl-4');
        // $('#cel_Religi').addClass('col-xl-3');

        // $('#cel_Gender').removeClass('col-xl-2');
        // $('#cel_Gender').addClass('col-xl-3');
        // $('#cel_Sexual').removeClass('col-xl-4');
        // $('#cel_Sexual').addClass('col-xl-3');

        $('#cel_Est-8-Scl').removeClass('col-xl-8');
        $('#cel_Est-8-Scl').addClass('col-xl-6');
        $('#cel_Chartr').removeClass('col-xl-4');
        $('#cel_Chartr').addClass('col-xl-6');

        $('#cel_Nation_out').removeClass('col-sm-11');
        $('#cel_Nation_out').addClass('col-sm-9');
        $('#cel_Nation_out').removeClass('col-md-10');
        $('#cel_Nation_out').addClass('col-md-9');
        // $('#cel_Nation_out').removeClass('col-lg-6');
        // $('#cel_Nation_out').addClass('col-lg-6');
        // $('#cel_Nation_out').removeClass('col-xxl-6');
        // $('#cel_Nation_out').addClass('col-xxl-5');
        $('#cel_Nation_out').removeClass('col-xxl-6');
        $('#cel_Nation_out').addClass('col-xxl-5');

        $('#cel_Class_out').removeClass('col-lg-6');
        $('#cel_Class_out').addClass('col-lg-5');
        $('#cel_Class_out').removeClass('col-xxl-5');
        $('#cel_Class_out').addClass('col-xxl-6');

        $('#cel_Name_out').removeClass('col-lg-10');
        $('#cel_Name_out').addClass('col-lg-9');
        $('#cel_Name_out').removeClass('col-xxl-7');
        $('#cel_Name_out').addClass('col-xxl-6');

        $('#cel_Strength_out').removeClass('col-md-10');
        $('#cel_Strength_out').addClass('col-md-11');

        $('#cel_Virtue_out').removeClass('col-sm-11');
        $('#cel_Virtue_out').addClass('col-sm-10');
        $('#cel_Virtue_out').removeClass('col-md-10');
        $('#cel_Virtue_out').addClass('col-md-9');
        $('#cel_Virtue_out').removeClass('col-lg-6');
        $('#cel_Virtue_out').addClass('col-lg-5');
        $('#cel_Virtue_out').removeClass('col-xxl-6');
        $('#cel_Virtue_out').addClass('col-xxl-5');

        $('#cel_Hubris_out').removeClass('col-lg-5');
        $('#cel_Hubris_out').addClass('col-lg-6');
        // $('.button-gen').removeClass('lang-ru');
    }
 }

//$("#s_lang [value='" + localStorage.getItem('Lang') + "']").attr("selected", "selected");

// перевод ИНТЕРФЕЙСА //
const TRANSLATE_BD = [
    {id: 'site-title', eng: 'NPC Generator', rus: 'НИП Генератор',},
    {id: 'page-title', eng: 'NPC Generator', rus: 'НИП Генератор',},
        {id: 'lang_EN', eng: 'EN', rus: 'Анг',},
        {id: 'lang_RU', eng: 'RU', rus: 'Рус',},
    // menu
    // {id: 'vershistory',eng: 'Version History:', rus: 'История Версий:',},
    // select table
    {id: 'l_Setting',  eng: 'Setting', rus: 'Сеттинг',},
        {id: 'l_7th-Sea',  eng: `7ᵗʰ Sea™`, rus: `7-е Море™`,},
    {id: 'l_Rules',    eng: '& Rules', rus: 'и Правила',},
        {id: 'l_2nd-ed',   eng: `2nd Edition`, rus: '2-я редакция',},
    {id: 'l_Nation',   eng: 'Nation', rus: 'Страна',},
        {id: 'l_random',   eng: 'Random', rus: 'случайно',},
        {id: 'l_avalon',   eng: 'Avalon', rus: 'Авалон',},
        {id: 'l_castille', eng: 'Castille', rus: 'Кастилия',},
        {id: 'l_eisen',    eng: 'Eisen', rus: 'Эйзен',},
        {id: 'l_montaigne',eng: 'Montaigne', rus: 'Монтень',},
        {id: 'l_sarmatia', eng: 'Sarmatia', rus: 'Сарматия',},
        {id: 'l_ussura',   eng: 'Ussura', rus: 'Уссура',},
        {id: 'l_vendel',   eng: 'Vendel / Vesten', rus: 'Вендэль / Вэстэн',},
        {id: 'l_vodacce',  eng: 'Vodacce', rus: 'Водачче',},
    {id: 'l_Gender',   eng: 'Gender', rus: 'Гендер',},
        {id: 'l_random2',  eng: 'Random', rus: 'случайно',},
        {id: 'l_Female',   eng: 'Female', rus: 'Женщина',},
        {id: 'l_Male',     eng: 'Male',   rus: 'Мужчина',},
        {id: 'l_NonBin',   eng: 'Non-Binary', rus: 'Не бинарный',},
    {id: 'l_Origin',   eng: 'Origin', rus: 'Народ',},
        {id: 'l_random3',   eng: 'Random', rus: 'случайно',},
        {id: 'l_avalon2',   eng: 'Avalon', rus: 'Авалон',},
        {id: 'l_Highland',  eng: 'Highland Marches', rus: 'Горные Марши',},
        {id: 'l_Inismore',  eng: 'Inismore', rus: 'Инисмор',},
        {id: 'l_castill2',  eng: 'Castille', rus: 'Кастилия',},
        {id: 'l_eisen2',    eng: 'Eisen', rus: 'Эйзен',},
        {id: 'l_montaign2', eng: 'Montaigne', rus: 'Монтень',},
        {id: 'l_sarmatia2', eng: 'Sarmatia', rus: 'Сарматия',},
        {id: 'l_ussura2',   eng: 'Ussura', rus: 'Уссура',},
        {id: 'l_vendel2',   eng: 'Vendel / Vesten', rus: 'Вендэль / Вэстэн',},
        {id: 'l_vodacce2',  eng: 'Vodacce', rus: 'Водачче',},
        {id: 'l_shw_Origin',  eng: 'output', rus: 'выводить',},
    {id: 'l_Sexual',   eng: 'Sexuality', rus: 'Ориентация',},
        {id: 'l_random4',  eng: 'Random',  rus: 'случайно',},
        {id: 'l_Asex',     eng: 'Asexual', rus: 'Асексуал',},
        {id: 'l_Bi',       eng: 'Bi',      rus: 'Би',},
        {id: 'l_Gay',      eng: 'Gay',     rus: 'Гей',},
        {id: 'l_Straight', eng: 'Straight',rus: 'нормалн.',},
    {id: 'l_Religi',   eng: 'Religion', rus: 'Вера',},
        {id: 'l_random5',   eng: 'Random',   rus: 'случайно',},
        {id: 'l_Avalonian', eng: 'Avalonian', rus: 'Авалонское',},
        {id: 'l_Protestan', eng: 'Protestant',rus: 'Отрицатель',},
        {id: 'l_Vaticine',  eng: 'Vaticine', rus: 'Ватицинское',},
        {id: 'l_Orthodox',  eng: 'Orthodox', rus: 'Православное',},
        {id: 'l_agnostic',  eng: 'Agnostic', rus: 'Aгностик',},
        {id: 'l_muslim',    eng: 'Muslim',   rus: 'Мусульманин',},
        {id: 'l_pagan',     eng: 'pagan',    rus: 'язычник',},
        {id: 'l_undefined', eng: 'undefined',rus: 'неизвестно',},
    {id: 'l_Age',      eng: 'Age',    rus: 'Возраст',},
    {id: 'l_Est-8-Scl',eng: `Estate & Social Class`, rus: `Сословие и Социальный Класс`,},
        {id: 'l_random7',   eng: 'Random', rus: 'случайно',},
        {id: 'l_Clergy',    eng: 'Clergy', rus: 'Духов-во',},
        {id: 'l_Army',      eng: 'Army', rus: 'Армия',},
        {id: 'l_Navy',      eng: 'Navy', rus: 'Флот',},
        {id: 'l_Citizen',   eng: 'Citizen', rus: 'Горожане',},
        {id: 'l_Villager',  eng: 'Villager',rus: 'Селяне',},
        {id: 'l_random8',   eng: 'Random', rus: 'случайно',},
        {id: 'l_Elite',   eng: 'Elite', rus: 'Элита',},
        {id: 'l_Upper',   eng: 'Upper class', rus: 'Высший',},
        {id: 'l_Top-M',   eng: 'Top-Middle', rus: 'Верх.Ср.',},
        {id: 'l_Low-M',   eng: 'Low-Middle', rus: 'Нижн.Ср.',},
        {id: 'l_Lower',   eng: 'Lower class', rus: 'Низший',},
        {id: 'l_Marginal',eng: 'Marginal', rus: 'Маргинал',},
    {id: 'l_Chartr',   eng: 'Character', rus: 'Персонаж',},
        {id: 'l_Name',      eng: 'Name',   rus: 'Имя',},
        {id: 'l_Brute',     eng: 'Brute',  rus: 'Брут',},
        {id: 'l_Hero',      eng: 'Hero',   rus: 'Герой',},
        {id: 'l_Villain',   eng: 'Villain',rus: 'Злодей',},
    // button
    {id: 'generate',   eng: 'GENERATE',  rus: 'ГЕНЕРИТЬ',},
];
const lang_tag_array = [
  ['ID',         'ENGlish',       'RUSsian', ],
    ['l_generator',  'Character Generator', 'Генератор Персонажей'],
    ['l_options',  'Options', 'Настройки'],
    ['l_history',  'Version History', 'История Версий'],
    ['l_donate',   'Donate',  'Донат'],
  ['l_Sexua2',   'Sexuality', 'Сексуальная Ориентация'],
    ['l_random6',   'Random', 'случайно'],
    ['l_less1',  'less 1 year',   'до 1 года'],
    ['l_01_05',  '1...5 yo',   '1...5 лет'],
    ['l_06_10',  '6...10 yo',  '6...10 лет'],
    ['l_11_15',  '11...15 yo', '11...15 л.'],
    ['l_16_20',  '16...20 yo', '16...20 л.'],
    ['l_21_25',  '21...25 yo', '21...25 л.'],
    ['l_26_30',  '26...30 yo', '26...30 л.'],
    ['l_31_35',  '31...35 yo', '31...35 л.'],
    ['l_36_40',  '36...40 yo', '36...40 л.'],
    ['l_41_45',  '41...45 yo', '41...45 л.'],
    ['l_46_50',  '46...50 yo', '46...50 л.'],
    ['l_51_55',  '51...55 yo', '51...55 л.'],
    ['l_56_60',  '56...60 yo', '56...60 л.'],
    ['l_61_65',  '61...65 yo', '61...65 л.'],
    ['l_66_70',  '66...70 yo', '66...70 л.'],
    ['l_71_75',  '71...75 yo', '71...75 л.'],
    ['l_76_80',  '76...80 yo', '76...80 л.'],
    ['l_81_85',  '81...85 yo', '81...85 л.'],
    ['l_86_90',  '86...90 yo', '86...90 л.'],
    ['l_91_95',  '91...95 yo', '91...95 л.'],
    ['l_96_100', '96...100yo', '96...100л.'],
]
// перевод переменных генерации //
const lang_Nation = [
  ['EN', "Avalon", "Castille", "Eisen", "Montaigne", "Sarmatia", "Ussura", "Vendel", "Vodacce", ],
  ['RU', "Авалон", "Кастилия", "Эйзен", "Монтень",   "Сарматия", "Уссура", "Вендель", "Водачче", ],
];
const lang_Origins = [
  ['EN', "Avalon", "Highland", "Inismore", "Castille", "Eisen",
    "Montaigne", "Sarmatia", "Ussura", "Vendel", "Vodacce", "Cressent", "Judas", "Catai",],
  ['EN', "Авалон", "Горные Марши", "Инисмор", "Кастиллия", "Эйзен",
    "Монтень", "Сарматия", "Уссура", "Вендель", "Водачче", "Имп. Полумесяца", "иудей", "Катай",],
  ];
const lang_Religion = [
  ['EN', "Avalonian", "Protestant", "Vaticine", "Orthodox", "agnostic", "muslim", "pagan", "unknown", "Judaist", "oter",],
  ['RU', "Авалонское", "Протестанское", "Ватицинское", "Ортодоксальное", "агностик", "мусульманское", "язычник", "неизвестно", "иудейское", "другое",],
];
const lang_Sexuality = [
  ['EN', "Straight", "Some Exp",  "Asexual",  "Bi", "Gay",],
  ['RU', "натурал",  "разн.опыт", "асексуал", "би", "гей",],
];
const lang_Ages = [
  ["less than 1 y.o.", " y.o.", " y.o.", " y.o.",],
  ["младше 1 года",    " год",  " года", " лет",],
];
// Социальные КлассЫ //
const lang_Class = [
  ['EN', "Archbishop", "Bishop", "Abbot Parliamentarian", "Abbot", "Prior",
   "Archdeacon", "Deacon", "Canonic", "Superior", "Priest", "Vicar", "Chaplain", "Monk", "Hermit",
   "Field Marshal", "General", "Lieutenant General", "Major General", "Brigadier",
   "Colonel", "Lieutenant Colonel", "Major", "Captain", "Lieutenant", "Second Lieutenant",
   "Staff Sergeant", "Sergeant", "Corporal", "Lance Corporal", "Soldier",
   "Navy Captain", "Navy Lieutenant", "Navy Master", "Navy Purser", "Midshipman",
   "Midshipman's mate", "Master's mate", "Gunner", "Boatswain", "Carpenter",
   "Armourer", "Ropemaker", "Caulker", "Master-at-arms", "Sailmaker", "Coxswain", "Quartermaster",
   "Cooper", "Ship's corporal", "Watch captains", "Armourer's mate", "Gunner's mate", "Boatswain's mate", "Caulker's mate",
   "Carpenter's mate", "Sailmaker's mate", "Quartermaster's mate", "Able Seaman", "Ordinary Seaman", "Boy",
   "Duke", "Marquis", "Earl (Count)", "Viscount", "Baron", "Baronet", "Mayor",
   "Rich Merchant", "Alderman", "Merchant", "Small Merchant", "Expert",
   "Shopkeeper", "Artisan", "Laborer", "Servant", "Beggar", "Criminal",
   "Knight", "Rich Squire", "Rich Gentleman", "Squire", "Gentleman", "Yeoman",
   "Freeholder", "Farmer", "Copyholder", "Villein", "Farmhand", "Vagrant",
   "Bojarin", "Black-sew peasant", "Serf peasant", ],
  ['RU', "Архиепископ", "Епископ", "Аббат-парламентарий", "Аббат", "Приор",
   "Архидьякон", "Дьякон", "Каноник", "Настоятель", "Священник", "Викарий", "Капелан", "Монах", "Отшельник",
   "Фельдмаршал", "Генерал", "Генерал-лейтенант", "Герерал-майор", "Бригадир",
   "Полковник", "Подполковник", "Майор", "Капитан", "Лейтенант", "Младший лейтенант",
   "Старший сержант", "Сержант", "Капрал", "Ефрейтор", "Солдат",
   "Капитан флота", "Лейтенант флота", "Корабельный мастер", "Корабельный казначей", "Мичман",
   "Помошник мичмана", "Помошник корабельного мастера", "Артиллерист", "Боцман", "Плотник",
   "Оружейник", "Канатный мастер", "Конопатчик", "Мастер по оружию", "Парусный мастер", "Рулевой", "Квартермейстер",
   "Бондарь", "Капрал корабля", "Капитан вахты", "Помошник оружейника", "Помошник артиллериста", "Помошник боцмана", "Помошник конопатчика",
   "Помошник конопатчика", "Помошник парусника", "Помошник квартирмэйстера", "Старший матрос", "Мартос", "Юнга",
   "Герцог", "Маркиз", "Граф", "Виконт", "Барон", "Бароннет", "Мэр",
   "Богатый купец", "Олдермэн", "Купец", "Мелкий купец", "Эксперт",
   "Лавочник", "Специалист", "Чернорабочий", "Слуга", "Нищий", "Преступник",
   "Рыцарь", "Богатый сквайр", "Богатый джентельмен", "Сквайр", "Джентельмен", "Йомэн",
   "Фрихольдэр", "Фермер", "Копихольдэр", "Виллан", "Батрак", "Бродяга",
   "Боярин", "Черносошный крестьянин", "Крепостной крестьянин",],
  ['ru', "архиепископа", "епископа", "аббата-парламентария", "аббата", "приора",
   "архидьякона", "дьякона", "каноника", "настоятеля", "священника", "викария", "капелана", "монаха", "отшельника",
   "фельдмаршала", "генерала", "генерал-лейтенанта", "герерал-майора", "бригадира",
   "полковника", "подполковника", "майора", "капитана", "лейтенанта", "младшего лейтенанта",
   "старшнго сержанта", "сержанта", "капрала", "ефрейтора", "солдата",
   "капитана флота", "лейтенанта флота", "корабельного мастера", "корабельного казначея", "мичмана",
   "помошника мичмана", "помошника корабельного мастера", "артиллериста", "боцмана", "плотника",
   "оружейника", "канатного мастера", "конопатчика", "мастера по оружию", "парусного мастера", "рулевого", "квартермейстера",
   "бондаря", "капрала корабля", "капитана вахты", "помошника оружейника", "помошника артиллериста", "помошника боцмана", "помошника конопатчика",
   "помошника конопатчика", "помошника парусника", "помошника квартирмэйстера", "старшего матроса", "мартоса", "Юнги",
   "герцога", "маркиза", "графа", "виконта", "барона", "бароннета", "мэра",
   "богатого купца", "олдермэна", "купца", "мелкого купца", "эксперта",
   "лавочника", "специалиста", "чернорабочего", "слуги", "нищего", "преступника",
   "рыцаря", "богатого сквайра", "богатого джентельмена", "сквайра", "джентельмена", "йомэна",
   "фрихольдэра", "фермера", "копихольдэра", "виллана", "батрака", "бродяги",
   "боярина", "черносошного крестьянина", "крепостного крестьянина",],
 ];
// Имена иМена имеНа //
const M_EN_H_Names = [M_EN_H_Names_EN, [ /* Таблица high-class мужских английских высоких имён */
   "Аарон", "Адам", "Альберт", "Александр", "Альфрэд", "Эндрю", "Антони", "Арнольд", "Артур",
   "Бенджамин", "Бэрнард", "Брандон", "Бартоломью",
   "Кэльвин", "Карлос", "Чарльз", "Кристиан", "Кристофер", "Кёртис",
   "Даниэль", "Давид", "Дэвис", "Дэннис", "Дэрэк", "Дональд", "Дуглас", "Дастин", "Дилан",
   "Эдгар", "Эдмон", "Эдвард", "Эдвин", "Элтон", "Эммет", "Эрнэст", "Этан",
   "Фердинанд", "Флойд", "Фрэнсис", "Фрэдэрик", "Фуллер",
   "Джордж", "Геральд", "Гильберт", "Гловер", "Гордон", "Грехем",
   "Гарольд", "Гаррисон", "Гербэрт", "Говард",  "Джэймс", "Джонатан", "Кит", "Кэннэт", "Кэвин",
   "Леонард", "Луи", "Мартин", "Марвин", "Морис", "Максимилиан", "Мэлвин", "Майкл",
   "Натан", "Норман", "Оливер", "Оскар", "Остин", "Освальд", "Овен",
   "Патрик", "Пол", "Питер", "Филип",  "Ральф", "Рэймонд", "Ричард", "Роберт", "Роджер", "Роланд", "Рональд",
   "Самуэль", "Симон", "Стивен",  "Теодор", "Томас", "Виктор", "Вэйн", "Вилгельм", "Вильям", "Вильсон", ],];
const M_EN_Names = [M_EN_Names_EN, [ /* Таблица людских мужских английских имён */
  "Аарон", "Адам", "Алан", "Альберт", "Александр", "Альфрэд", "Эндрю", "Антони", "Арнольд", "Артур",
  "Барри", "Бенджамин", "Бэрнард", "Брандон", "Браян", "Брюс", "Брайян",
  "Кэльвин", "Карлос", "Чарльз", "Чарли", "Крис", "Кристиан", "Кристофер", "Колин", "Конрад", "Кёртис",
  "Дэйл", "Даниэль", "Дэйв", "Дэвис", "Девис", "Дин", "Дэннис", "Дэрэк", "Дик", "Доналд", "Дуглас", "Дюк", "Дастин", "Дилан",
  "Эрл", "Эдгар", "Эдмон", "Эдвард", "Эдвин", "Элтон", "Эммет", "Эрик", "Эрнэст", "Этан",
  "Феликс", "Флойд", "Фрэнсис", "Фрэнк", "Фкллер",
  "Джордж", "Геральд", "Гильберт", "Гловер", "Гордон", "Грехем",
  "Гарольд", "Гаррисон", "Гарри", "Генри", "Гербэрт", "Говард",
  "Джэймс", "Джэф", "Джэрри", "Джим", "Джоэль", "Джон", "Джонатан",
  "Кэйн", "Кит", "Кэннэт", "Кэвин", "Курт",      "Ларри", "Леонард", "Луи", "Линн",
  "Марк", "Мартин", "Марвин", "Мэт", "Морис", "Мэлвин", "Майкл",
  "Натан", "Нил", "Нил", "Норман",      "Оливер", "Оскар", "Остин", "Освальд", "Овен",
  "Патрик", "Пол", "Питэр", "Филип",      "Ральф", "Рэнди", "Рэймонд", "Риччард", "Роберт", "Роджэр", "Роланд", "Рональд", "Рой",
  "Самюэль", "Симон", "Стивен", "Стив",      "Тэрри", "Тэодор", "Томас",
  "Виктор", "Вэйн", "Вилгельм", "Вильям", "Вильсон", ],];
const M_EN_L_Names = [M_EN_L_Names_EN, [ /* Таблица людских мужских английских низких имён */
  "Аарон", "Адам", "Алан", "Алекс", "Энди", "Арни", "Арти",
  "Барри", "Бэн", "Бэнджи", "Бэрни", "Бил", "Билли", "Боб", "Бобби",
  "Брад", "Бранд", "Браян", "Брюс", "Брайян", "Бад", "Барт", "Бас", "Бэрт",
  "Кэл", "Крл", "Чак", "Крис", "Колин", "Конни", "Кёртис",
  "Дэйл", "Дэн", "Дэнни", "Дэйв", "Дэвид", "Дэвис", "Дин", "Дэн", "Дирк", "Дик", "Дон", "Доналд", "Дюк", "Дилан",
  "Эрл", "Эдгар", "Эд", "Эдвин", "Элтон", "Эммет", "Эрик", "Эрни", "Этан",
  "Феликс", "Флойд", "Фрэнк", "Фрэд", "Фуллер",
  "Гарри", "Джордж", "Гловэр", "Гордон", "Грэхэм", "Грэг",
  "Гарри",  "Джэк", "Джэйк", "Джэймс", "Джэй", "Джэф", "Джерри", "Джим", "Джоэл", "Джон", "Джонни", "Джон",
  "Кэйн", "Кит", "Кен", "Кевин", "Курт", "Кит",      "Ларри", "Лео", "Луи", "Линн",
  "Марк", "Мартин", "Марв", "Мэтт", "Макс", "Мэл", "Митч", "Майк",
  "Натан", "Нил", "Нэл", "Ник", "Норман",
  "Оливер", "Оскар", "Остин", "Освальд", "Овен",
  "Патрик", "Пол", "Пит", "Питэр", "Фил",
  "Ральф", "Рэнди", "Рик", "Роб", "Роджэр", "Роланд", "Рональд", "Ронни", "Рой",
  "Сэм", "Сид", "Симон", "Смит", "Стив", "Спайк", "Сэнди",
  "Тэд", "Тэрри", "Тим", "Том", "Тони",
  "Вик", "Вэйн", "Вилли", "Вилсон", ],];
const F_EN_H_Names = [F_EN_H_Names_EN, [ /* Таблица high-class людских женских английских высоких имён */
   "Эбигэйль", "Агнэс", "Адэлаида", "Элис", "Аманда", "Амелия", "Александрия",
   "Анастасия", "Ангелина", "Ариэль", "Одри", "Эвэри", "Эшли",
   "Барбара", "Беатрис", "Бриджит", "Бритни",
   "Камилла", "Каролина", "Кассандра", "Констанц", "Кристина", "Шарлота", "Шерил", "Катрин",
   "Диана", "Дороти",  "Ева", "Эвелин", "Эдисон", "Эдит", "Елеанор",
   "Элизабет",  "Эстєр",  "Флоранс",  "Габриэль", "Гвендолин", "Гвиннет", "Глория", "Грэйс",
   "Хезэр",  "Изабелла", "Ирэн",   "Джульет", "Дженис", "Дженифер", "Джессика",
   "Джоан", "Джоди", "Джойс", "Джоселин", "Джулиет", "Жаклин", "Жанэт", "Жозефина",
   "Катерина", "Кимберли",   "Лаура", "Лэона", "Лесли", "Лидия", "Лилиан", "Линда", "Луиза",
   "Мадэлин", "Маргарэт", "Мария", "Марсия", "Мэлисса", "Мэриэн", "Миранда", "Моника",
   "Мадисон", "Мэнди", "Мюриэль",   "Наоми", "Натали", "Николь", "Нора", "Норма",
   "Оливия",  "Памэла", "Патриция", "Паула", "Присцилла",
   "Рэбэкка", "Регина", "Рэйчэл", "Розмари", "Роуз", "Рут",
   "Сабрина", "Саманта", "Сандра", "Сара", "Селена", "Скарлет", "София", "Стелла", "Сьюзан",
   "Тэрэза", "Тиффани",   "Шэйла", "Шарон", "Шэрилл", "Ширли",
   "Валэри", "Ванэсса", "Вероника", "Вивиан", "Виктория", "Виолета", "Вирджиния", ],];
const F_EN_Names = [F_EN_Names_EN, [ /* Таблица людских женских английских имён */
   "Эбигэйль", "Агата", "Агнэс", "Ида", "Ирис", "Элис", "Аманда", "Амэлия",
   "Анастасия", "Ангелина", "Анн", "Ариэль", "Арья", "Одри", "Эвэри", "Эшли",
   "Барбара", "Беатрис", "Бриджит", "Бритни", "Бэтти",
   "Камилла", "Карлина", "Констанц", "Кристина", "Кэнди", "Сесил", "Хлоя", "Шерил", "Катрин",
   "Дэбра", "Диана", "Дороти",  "Ева", "Эвелин", "Эдисон", "Эдит", "Элеанор",
   "Элизабет", "Элла", "Эмили", "Эмма", "Эстєр",  "Флоранс",
   "Габриэль", "Гвиннет", "Глория", "Грэйс", "Джилл", "Джина",
   "Хезэр",  "Иви", "Изабелла", "Ирма", "Ирэн",
   "Джулиет", "Джэйн", "Дженис", "Джэнни", "Дженифер", "Джесси", "Джессика",
   "Джоан", "Джоди", "Джойс", "Джоселин", "Джуди", "Джулия", "Джун",
   "Джанет",       "Карэн", "Катерина", "Кимберли", "Кэлли",
   "Лаура", "Лэйла", "Лэона", "Лесли", "Лидия", "Лилиан", "Линда", "Люси",
   "Мадэлин", "Маргарэт", "Мария", "Марсия", "Мэлисса", "Мэриэн", "Миранда", "Мия", "Молли", "Мона", "Моника", "Магги",
   "Мадисон", "Мэй", "Мэнди", "Мари", "Мюриэль",
   "Наоми", "Натали", "Николь", "Нора", "Норма", "Нэнси",  "Оливия",
   "Памэла", "Патрисия", "Паула", "Пэгги", "Пэйдж", "Пэнни", "Полли",
   "Рэбэкка", "Регина", "Рэйчэл", "Розмари", "Роуз", "Рут",
   "Сабрина", "Салли", "Саманта", "Сандра", "Сара", "Селена", "Сэнди", "Скарлет", "София", "Стэйси", "Стелла", "Сьюзан",
   "Тэрэза", "Тина", "Тиффани", "Трэйси",   "Шэйла", "Шарон", "Шэрри", "Ширли",
   "Валэри", "Ванэсса", "Вероника", "Вивиан", "Виктория", "Виола", "Вирджиния", "Вэнди", "Зара", "Зои", ],];
const F_EN_L_Names = [F_EN_L_Names_EN, [ /* Таблица людских женских английских low имён */
   "Агата", "Агнэс", "Адэль", "Ида", "Ирис", "Элис", "Аманда", "Амэлия",
   "Анн", "Ариэль", "Арья", "Одри", "Эвэри", "Эшли",
   "Барбс", "Биата", "Бриджит", "Бритни", "Бэтси", "Бэтти", "Бэлла", "Бэкки", "Бэсс",
   "Камил", "Кэйс", "Кристи", "Кэнди", "Сесил", "Хлоя", "Шерил", "Кэтт",
   "Дэбра", "Ди", "Дороти", "Дрина",  "Ева", "Эвелин", "Эдисон", "Эдит", "Элиза",
   "Элизабэт", "Элла", "Эмили", "Эммма", "Эстэр",  "Флор",
   "Габи", "Гвэн", "Гивэн", "Грэйс", "Джил", "Джин", "Джинни",
   "Хэзэр",  "Иви", "Ирма", "Ирэн",
   "Джули", "Джэйн", "Джани", "Джэнни", "Джэсси", "Джоси",
   "Джоан", "Джоди", "Джойс", "Джуди", "Джулия", "Джун", "Джэси", "Джэнэт", "Джози",
   "Карэн", "Кэйт", "Ким", "Кэлли",
   "Лаура", "Лэйла", "Леона", "Лэсли", "Лидия", "Лилли", "Линда", "Люси",
   "Мади", "Марго", "Мария", "Мэлл", "Мари", "Мира", "Мия", "Молли", "Мона", "Мэгги", "Мэг",
   "Мэй", "Мэнди", "Мари",      "Наоми", "Натали", "Николь", "Нора", "Норма", "Нэнси", "Нэсси",
   "Оливия",  "Памэла", "Пати", "Паула", "Пэгги", "Пэйдж", "Пэнни", "Полли",
   "Рэйчэл", "Рози", "Роуз", "Рут",
   "Сабрина", "Салли", "Сэми", "Сандра", "Сара", "Сэнди", "Софи", "Стэйси", "Стэлла", "Сюзан",
   "Тереза", "Тина", "Трэйси", "Трисия",     "Шэйла", "Шарон", "Шэрри", "Ширли",
   "Лэри", "Вэсс", "Вера", "Виви", "Вики", "Виола",
   "Вэнди", "Зара", "Зои", ],];
const M_SP_Names = [M_SP_Names_EN, [ /* Таблица людских мужских испанских имён */
   "Антонио","Адан","Аполинар","Адриан","Амэнкайо","Аарон","Асдрубэл",
   "Бэрнардо","Беренгар","Бернардино","Бернардо","Бартолоум","Базилио",
   "Джуан","Джуанито","Джулиан","Джулио","Доротэо","Джуниперо","Джасинто",
   "Зэкэриас",
   "Иниго","Иносэнсио",
   "Ксимен","Ксименез","Керро",
   "Луис","Лукас","Лусио",
   "Максимилиано","Маурицио","Мэксимино",
   "Наркизо","Новайо",
   "Пакуито",
   "Руи","Рэгуло",
   "Созимо","Серджио",
   "Фидэль",
   "Херберто","Хериберто","Херменежилдо","Херминио","Хернандо","Хернэн",
   "Цезарь",
   "Эмилиэно","Эдгардо","Энэко","Эдмундо",],];
const Maria_lang = ["María", "Мария"];
const Maria_Names = [Maria_Names_EN, [ /* María */
     " дэ лас Мерсэдэс", " дэ лос Долорэс", " ла Рэгина дэ лос Áнгелес",
     " дэль Апаро", " дэ ла Анунсиальон", " дэ ла Луз", " дэ лос Милагрос",
     " дэ ла Пиедад", " дэль Соссоро", " дэ ла Круз", " дэль Консуэло",
     " дэ ла Соледад", " дэ ла Салуд", " дэль Пилар", " дэ Монстреррад", ],];
const F_SP_Names = [F_SP_Names_EN, [ /* Таблица людских женских Испанских имён */
   "Ампэро","Адонсия","Арэсели",
   "Белен","Брунильда","Бенигна","Бенита","Беренгания",
   "Дулсе","Джуана","Джуанита","Джозефа",
   "Гваделупа","Гертрудис",
   "Исбель","Инэс","Исобел","Идоя","Изэния",
   "Карла","Ксимена","Кармела","Кармэлита","Карменкита",
   "Лорэна","Лусия","Лаура",
   "Мигуэла","Макэрена","Макэрия","Милагрос",
   "Николэса","Нилда",
   "Одэлис","Олалла","Олдонза",
   "Петрона","Пиа","Пидэд","Пилар","Пили",
   "Роза",
   "Синобия","Сэлуд","Сэнча","Сарита","Сэнчия",
   "Тэрэса",
   "Энкарна","Энкарнасьон","Энкарнита","Энрикуэта","Эдельмира","Эсмеральда",],];
const M_GE_Names = [M_GE_Names_EN, [ /* Таблица людских мужских германских / немецких имён */
   "Пэтэр", "Михаэль", "Томас", "Эндрюс", "Вольфган", "Клаус", "Юргэн", "Гюнтэр", "Стэван", "Кристиан",
   "Увэ", "Вэрнер", "Хорст", "Франк", "Дитэр", "Манфрэд", "Герхард", "Ганс", "Бэрнт", "Торстэн",
   "Матиас", "Гэльмут", "Вальтэр", "Хайнц", "Мартин", "Йерг", "Ральф", "Йенс", "Свэн", "Александр",
   "Максимильян", "Александэр", "Лэон", "Пол", "Лука", "Элиас", "Феликс", "Лукас", "Йонас", "Давид",
   "Лукас", "Тобиас", "Юлиан", "Симон", "Мартин", "Гюнтэр", "Себастьян", "Александэр", "Гельмут", "Флориан",
   "Карл", "Хайнц", "Элиас", "Александр", "Даниэль", "Лука",
   "Элиас", "Александр", "Даниэль", "Лука", "Давид", "Михэль", "Лиам", "Йонас", "Ной", "Лукас",
   "Юлиан", "Томас", "Линус", "Сабастиан", "Флоран", "Фабиан", "Леви", "Симон", "Милан", "Андрэс",
   "Йан", "Сэмюэль", "Робин", "Тобиас", "Эмиль", "Тим", "Кристиан", "Адриан", "Маркус", "Феликс",
   "Пол", "Бенжамин", "Марсель", "Дамиан", "Джонатан", "Финн", "Мартин", "Мануэль", "Стэфан", "ПАтрик",
   "Оливер", "Доминик", "Пэтэр", "Марвин", "Мориц", "Йонас", "Филип", "Антон", "Том", "Макс", ],];
const F_GE_Names = [F_GE_Names_EN, [ /* Таблица людских женских германских / немецких имён */
   "Урсула", "Карин", "Хельга", "Сабина", "Ингрид", "Рената", "Моника", "Сузанна", "Гизела", "Петра",
   "Бриджит", "Андрэа", "Анна", "Бриджит", "Клаудиа", "Эрика", "Криста", "Элки", "Стэфани", "Гертруда",
   "Элизабэт", "Мария", "Ангелика", "Хайке", "Габриэль", "Катрин", "Ильза", "Николь", "Аня", "Барбара",
   "Мари", "Софи", "Мария", "Анна", "Эмма", "Миа", "София", "Леони", "Лена", "Йоханна",
   "Леони", "Сара", "Анна", "Ханна", "Лена", "Юлия", "Софи", "Катарина", "Лаура", "Лара",
   "Линней", "Анна-Лена", "Лиза-Мари", "Юлия",  "Лаура",
   "Юлия", "Лаура", "Анна", "Эмма", "Лия", "Лиза", "Сара", "Мария", "Лена", "Лина",
   "Алина", "Эмилия", "Мия", "Ханна", "Лара", "Елена", "Ванэсса", "Сифи", "Селина", "Нина",
   "Леони", "Йоханна", "Мелина", "Мари", "Лиуса", "Йана", "Сандра", "Джессика", "Эмили", "Мила",
   "Нели", "Мелани", "Катарина", "София", "Уна", "Тереза", "Зои", "Элизабет", "Жасмин", "Мишель",
   "Клаудия", "Валентина", "Франциска", "Нидин", "Аника", "Николь", "Шарлота", "Нора", "Йенифер", "Сабрина", ],];
const M_FR_Names = [M_FR_Names_EN, [ /* Таблица людских мужских французских имён */
   "Жан", "Мишель", "Филипп", "Ален", "Патрик", "Пьер", "Николас", "Кристоф", "Кристиан", "Даниэль",
   "Бэрнард", "Эрик", "Фрэдэрик", "Лоран", "Оливер", "Стéфан", "Паскаль", "Давид", "Гéральд", "Юлиан", "Жак",
   "Ален", "Альбэрт", "Александр", "Алэксис", "Андрé", "Баярд", "Бэрнард", "Бертран", "Чарльз", "Дэнис",
   "Доминик", "Эдвард", "Эли", "Эмануэль", "Эрик", "Этьен", "Франсуа", "Жорж", "Гéральд", "Гилберт",
   "Жиль", "Юбер", "Уге", "Жан", "Люк", "Луи", "Людовик", "Морис", "Матье", "Мишель",
   "Николя", "Пол", "Филип", "Пьер", "Раймонд", "Робэрт", "Тибо", "Урбан", "Винсент", "Ксавье",
   "Ив", "Жан-Клод", "Жан-Жак", "Жан-Мишель", ],];
const M_FR_sm_Names = [M_FR_sm_Names_EN, [ /* Таблица small мужских французских имён */
   "Лино", "Бельбо", "Ксанто", "Лихо", "Адé", "Дайя", "Надо", "Ато", "Чарли", "Денизо",
   "Доми", "Нэд", "Лу", "Амель", "Рик", "Тино", "Франк", "Джори", "Адар", "Берти",
   "Эжи", "Альберт", "Алекс", "Алексис", "Андрэ", "Баярд", "Бернард", "Бертран", "Чарльз", "Дэнис",
   "Бертини", "Уга", "Жаки", "Жони", "Любель", "Людо", "Муха", "Матé", "Миха", "Ник",
   "Паоло", "Фило", "Пий", "Рами", "Бэрто", "Тауби", "Урфе", "Вичи", "Ксерс", "Ив",],];
const F_FR_Names = [F_FR_Names_EN, [ /* Таблица людских женских французских имён */
   "Мари", "Натали", "Изабэль", "Сильвия", "Катрин", "Франсуаза", "Мартина", "Кристина", "Моник", "Николь",
   "Валéри", "Софи", "Энн", "Сéлин", "Бриджит", "Лоуренс", "Жаклин", "Мишель", "Доминик", "Коринн",
   "Орéли", "Сéлин", "Бриджит", "Патрисия",  "Мари", "Эмма", "Камилл", "Мари",
   "Роман", "Камилла", "Анаис", "Жустин", "Зои", "Сара", "Джейд", "Инèс", "Шарлота", "Ева",
   "Луиза", "Полина", "Лéя", "Манон", "Клара", "Эмма", "Осéaн", "Люси", "Хлоя", "Жули", ],];
const M_PL_Names = [M_PL_Names_EN, [ /* Таблица людских мужских сарматских / Балканских и польских имён */
   "Богдан", "Божидар", "Богумил", "Богуслав", "Болеслав", "Бронислав", "Чеслав", "Ярослав",
   "Казимеж", "Лех", "Лстислав", "Лехослав", "Леслав", "Лешек", "Людомир", "Мечислав",
   "Мешко", "Мирослав", "Пшемыслав", "Радослав", "Радимир", "Славомир", "Станислав", "Томислав",
   "Вачлав", "Венцислав", "Веслав", "Владислав", "Влодимеж", "Войцех", "Збигнев", "Ждислав",
   "Земовит", "Пётр", "Лукаш", "Анджей", "Гжегож", "Яцек", "Ежи", "Мацей", "Миколай", "Тадеуш",
   "Вавжиц",
   "Станислав", "Влодимеж", "Войцех",
   "Ольгерд", "Витольд", "Гражина",  "Данута",
   "Альгирдас", "Витаутас", "Кястутис", "Бирути", ],];
const F_PL_Names = [F_PL_Names_EN, [ /* Таблица людских женских французских имён */
   "Божена", "Марзана", "Ванда", "Вислава", "Агнешка", "Малгожата", "Катаржина",
   "Ядвига", "Кинга", "Ольга", "Агне", "Жастина", "Аудра", "Лайма", "Рута",
   "Аушра", "Людвика", "Сауле", "Виталия", "Мариона", "Сваёнэ", "Габижа", "Морта",
   "Эгли", "Гидрэ", "Она", "Эдита", "Жинтаре", "Раса", "Ядвига", "Даина", "Рожэ",
   "Йоанна", "Алисия", "Элжбета", "Урсула", "Ядвига", "Малгожата", "Антонина", ],];
const M_VE_Names = [M_VE_Names_EN, [ /* Таблица людских мужских скандинавских имён */
   "Альто", "Андэрс", "Арнэ", "Арвид", "Асмунд", "Алекс",
   "Вьйорнс", "Бернт", "Берген", "Бертрам", "Бродэр",
   "Карсэн", "Каспер", "Клаус", "Канут",
   "Даан", "Даг", "Дэвид", "Дэвин",
   "Элвис", "Эмануал", "Эрик", "Эрик",
   "Фолкэ", "Франс", "Франсэн", "Фрэй",
   "Горан", "Гуннар",
   "Юрдис", "Ялмар", "Хавлок", "Харолд", "Хан", "Хандэн",
   "Исак",
   "Лакоб", "Ян", "Йен", "Ярэл", "Йеппе", "Йенс", "Юаким", "Йокум", ],];
const F_VE_Names = [F_VE_Names_EN, [ /* Таблица людских женских германских / немецких имён */
   "Андрэа", "Агата", "Агне", "Агнета", "Аннели",
   "Барбро", "Бегит", "Биржит", "Брита", "Бригита",
   "Карэн", "Карин", "Кристэн",
   "Герда", "Грета", "Гурдрун",
   "Хедда", "Хельга", "Хилдэ",
   "Яника", "Юни", "Юттэ",
   "Кайя", "Каллан", "Каран", "Карэна", "Кристина",
   "Майя", "Малин", "Мартэ", "Мэттэ", "Миа", "Микель", "Моника",
   "Рика", "Рикарда", "Ронья", "Рут",
   "Сана", "Сигне", "Соня", "Стина", "Сюрэн", "Сирин", ],];
const fathername_lang = ["sson", "ссон", "sdóttir", "сдоттир", ];
const M_VO_Names = [M_VO_Names_EN, [ /* Таблица людских мужских итальянских имён */
    "Адэле", "Адольфо", "Адриано", "Альберто", "Алессандро", "Алонсо", "Амато", "Амадэо", "Андрэа", "Анастасио",
    "Батиста", "Бальтассарэ", "Бэнвентуо", "Бертольд", "Бернардо",
    "Камилло", "Каллистро", "Касимиро", "Карлос", "Коломбано", "Конрад", "Кристиано", "Сесилио", "Чезарэ",
    "Дарио", "Дино", "Джэрардо", "Донато", "Дориэно",
    "Элижио", "Эмануэле", "Эннио", "Энрике", "Эрнесто", "Эухенио",
    "Фабио", "Фабриццо", "Фаусто", "Флавио", "Флоэрино", "Франко", "Фрэдо", "Фэрнандо", "Францис",
    "Гаспаро", "Геурин", "Густаво", "Гуидо", "Джеронимо", "Джузеппе", "Джиани", "Джино", "Джулиано", "Джанлука", "Джинкарно",
    "Хьго", "Джиронимо",
    "Итало",
    "Джакомо", "Джон",
    "Леопольдо", "Ладиславо", "Леонардо", "Лорэнцо", "Лусиано", "Луче", "Луиджи",
    "Марсо", "Манфрэдо", "Марио", "Мартино", "Марселло", "Массимилиано", "Маурицио", "Мэнлайо", "Мэрино",
    "Назарио", "Никола",
    "Орсино", "Оскар", "Орландо", "Оттавио",
    "Паоло", "Патрицио", "Просперо", "Пеллержио",
    "Ренато", "Риккардо", "Ругеррио",
    "Сандро", "Силвестри", "Серджио", "Силвио",
    "Тэофило", "Тэодоро",
    "Убэрто",
    "Валентино", "Винсент", "Виталэ", "Виктор",
    "Жанлуиджи", ],];
const F_VO_Names = [F_VO_Names_EN, [ /* Таблица людских женских Испанских имён */
    "Августина", "Адриана", "Альба", "Альбертина", "Антонэлла",
    "Беатрис",
    "Карла", "Кьяра",
    "Домэника",
    "Элена", "Эдда", "Элоиса", "Эрминия", "Эвлалия",
    "Фэдэрика", "Франческа",
    "Грация",
    "Имаколета",
    "Джулия", "Джульета",
    "Летиция", "Лукреция",
    "Маддалена",
    "Николетта", "Ноэми",
    "Орнэлла", "Оттавиа",
    "Патриция", "Перла",
    "Рэйчел", "Рикарда", "Росабелла", "Ромильда",
    "Симона", "Сюзана",
    "Тэофила", "Ксимена", "Гвадэлупэ", "Даниэла",
    "Виттория", "Мариа", "Андрэа", "Мария Хосе", "София", ],];
const name_union_lang = ["-y-", "-и-"];
const M_Names_RU = ["Случайно", M_EN_Names[1], M_SP_Names[1], M_GE_Names[1], M_FR_Names[1], M_PL_Names[1], M_RU_Names, M_VE_Names[1], M_VO_Names[1], ];
const F_Names_RU = ["Случайно", F_EN_Names[1], F_SP_Names[1], F_GE_Names[1], F_FR_Names[1], F_PL_Names[1], F_RU_Names, F_VE_Names[1], F_VO_Names[1], ];
const M_Names = [M_Names_EN, M_Names_RU, ];
const F_Names = [F_Names_EN, F_Names_RU, ];

// ФАМИЛИИ ФАмиЛии ФАмилиИИИ ///
const EN_Surnames_RU = [ /* Таблица людских английских фамилий */
    "Аддерий", "Аддингтон", "Адриан", "Элдридж", "Олфорд", "Алсоп",
    "Эндрюс", "Арчибальд", "Арнольд", "Артурс", "Аттвуд", "Одрэй", "Остин", "Айртон",
    "Бабкок", "Бэйкер", "Балдвин", "Барджман", "Барнс", "Баррингтон", "Баверман", "Бэйкэр", "Бэррингтон", "Бирч",
    "Бишоп", "Блэк", "Блэйр", "Блумфилд", "Булман", "Бутман", "Боусворт", "Брэдбэри", "Брэдшоу", "Брикман", "Брукс", "Браун", "Буш",
    "Калхун", "Кампбел", "Кэри", "Карингтон", "Кэрролл", "Картэр", "Чандтер",
    "Капман", "Честертон", "Чарлтон", "Клифорд", "Колман", "Конорс", "Кук", "Крамер", "Крэйтон", "Кроуфорд", "Кроссман",
    "Даниэльз", "Дэй", "Дин", "Дэррик", "Донован", "Дуглас", "Доуман", "Дутон", "Дюнкан", "Дюнк", "Дурман",
    "Эдингтон", "Эдвардс", "Эллингтон", "Элмерс", "Эванс",
    "Фабэр", "Фэйн", "Фармер", "Фарэл", "Финч", "Фишер", "Флэтчер", "Флеминг",
    "Форд", "Форман", "Форстэр", "Фостэр", "Фрэнсис", "Фрэйзер", "Фриман", "Фултон",
    "Гэлбрейт", "Гарднэр", "Гэйт", "Гералд", "Гиббс", "Гилберт", "Гилл", "Джилл", "Гулман", "Гудман", "Густман",
    "Хэйг", "Хэйли", "Хэмфри", "Хэнкок", "Хардман", "Хокинс", "Хиггис", "Ходжс", "Хоггарт", "Холидэй", "Холмс", "Ховард",
    "Джэймс", "Джэф", "Джэнкин", "Джэром", "Джонс",
    "Кит", "Кэлли", "Кэндал", "Кеннеди", "Кэннет", "Кингсман", "Кирк",
    "Лард", "Ламберт", "Ларкинс", "Лоуман", "Липман", "Леман", "Лювин", "Литтл", "Ливинстон", "Лонгман",
    "Майсей", "Макензи", "Мансфилд", "Марлоу", "Маршман", "Мэтьюз", "Мэрсэр", "Маерс", "Миллер", "Милн", "Милтон", "Молиган", "Мёрфи",
    "Нэш", "Натан", "Нил", "Нэвил", "Ньюман",
    "Окам", "Огден", "Олдман", "Олдридж", "Оливер", "Осборн", "Освальд", "Отис", "Овэн",
    "Пайдж", "Палмэр", "Пасс", "Пиакок", "Пэрси", "Филис", "Портэр",
    "Квинс", "Роли", "Ральф", "Рамси", "Рэйнолдс", "Ричардс", "Робертс", "Роджер", "Рассел", "Райдэр",
    "Салбюри", "Саломон", "Самюэль", "Сандэр", "Шекли", "Шэлдон", "Шэрлок", "Шортэр", "Саймон", "Смит", "Стэнли", "Стивен", "Сайкс",
    "Тафт", "Тайлор", "Торндайк", "Тортон", "Тимонс", "Трэйси", "Тёрнэр",
    "Винс", "Ваган", "Вэйрейд", "Вокман", "Уоллес",
    "Волер", "Вальтэр", "Вард", "Варен", "Вэйн", "Вэдстэр", "Уэсли", "Вайт", "Винтэр", "Вуд", "Йиманс", "Йанг", ];
const SC_Surnames_RU = [ /* Таблица людских шотландских фамилий */
    "Анструтер", "Арчи", "Армур", "Адам", "Артур", "Аберкромби", "Агкей", "Арескин",
    "Баррах", "Барклай", "Бортвик", "Броди", "Бьюкенен", "Белшез", "Бетон", "Бойд", "Бучан",
    "Форбс", "Гордон", "Гальт", "Гласс", "Грант", "Грахам", "Гэйр", "Гилберт",
    "Далтон", "Джонсон", "Дрюмонд", "Хаддон", "Хоум", "Хеннэй", "Иннэс",
    "Карнеги", "Кричтон", "Кеннеди", "Кэрр", "Кинкэйд", "Комби",
    "Лэсли", "Линдсэй", "Логан", "Локхарт", "Ламондсон", "Ламонд",
    "МакАдам", "МакАлистэр", "МакАндриас", "МакАльпин", "МакБэйн", "МакБрив", "МакГрэгор", "МакДуф",
    "МакДоналд", "МакДоннэл", "МакИналли", "МакКэнзи", "МакКинли",
    "МакКорри", "МакОвэн",  "МакЛарти", "МакЛахан", "МакКарти", "МакКенна", "МакГрат", "МакДермот",
    "МакЛахин", "МакМинн", "МакМахон", "МакНамара", "МакТавиш", "МакФарлайн", "МакФит", "МакКовэн", "Монро", "Марр",
    "Монгомери", "Моррис", "Моффат", "МакДугал", "МакЛеод", "МакЛин",
    "Нисбет", "Нэрн", "Огилви", "Олливант", "Поллок",
    "Ролло", "Рамси", "Росс", "Сэндиланд", "Синелэр", "Скотт", "Шоу", "Тодд", "Таус",
    "Уоллес", "Вэйр", ];
const IR_Surnames_RU = [ /* Таблица людских ирландских фамилий */
    "Бакли", "Бэлл", "Барнс", "Бирн", "Бойл", "Браун", "Брэнан", "Брэди", "Берк",
    "Каллен", "Кларк", "Коллинс", "Конолли", "Кэйси", "Кампбэл",
    "Дан", "Даффи", "Дойл", "Донэлли", "Донован", "Дэйли",
    "Галахэр", "Грифин", "Грахам",
    "Фитцджеральд", "Фитцпатрик", "Фланаган", "Флинн", "Фолей",
    "Хиггинс", "Хили", "Хоган", "Хигс", "Хайес",
    "Кэлли", "Кавана", "Кэйн", "Кэнэди", "Кэнни", "Кэйн", "O’Кин", "O’Кехэн", "Кинг",
    "Лайенс", "Линч", "Мерфи", "Магуайр", "Мэгги", "Маллан", "Мартин", "Махер", "Молони", "Моран", "Мур", "Мюррэей",
    "Нолан", "O’Браен", "O’Дваер", "O’Доннэл", "O’Доэрти", "O’Калаган", "O’Кифи", "O’Конелл", "O’Коннор", "O’Кэрол",
    "O’Лири", "O’Махони", "O’Нилл", "O’Рэйли", "O’Рурк", "O’Саливан", "O’Фарэлл", "O’Ши",
    "Повэр", "Куин", "Райян", "Райд", "Рейган",
    "Смит", "Стюарт", "Свини", "Шэхин", "Вайт", "Уилан", "Уолш", "Вард",];
const SP_Surnames_RU = [ /* Таблица людских ИСПАНСКИХ фамилий */
    "Гарсиа", "Фернáндес", "Гонсáлес", "Родригес", "Лопес", "Мартинес", "Санчес", "Перес", "Мартин", "Гóмес",
    "Агилар","Алонсо","Алварес","Ариас",
    "Бенитес","Бланко","Браво",
    "Кабальеро","Калво","Кампос","Кано","Кармона","Карраско","Кастильо","Кастро","Кортес","Крус",
    "Дельгадо","Дельгадо","Диес","Домингес","Дюран",
    "Эстебан",
    "Фернандес","Феррер","Флорес","Фуентес",
    "Гальярдо","Гальего","Гарсиа","Гарридо","Жименес","Гомес","Гонсалес","Герреро","Гутиерес",
    "Ернандес","Еррера","Ерреро","Идальго",
    "Иглесиас","Хименес",
    "Лопес","Лоренсо",
    "Маркес","Мартинес","Медина","Мендес","Молина","Монтеро","Мора","Моралес","Морено",
    "Наварро","Ньето",
    "Ортега","Ортис",
    "Парра","Паскуаль","Пастор","Пенья","Перес",
    "Рамирес","Рамос","Рей","Рейес","Родригес","Ромеро","Рубио","Руис",
    "Саес","Санчес","Сантана","Сантьяго","Сантос","Санс","Серрано","Суарес",
    "Торрес",
    "Варгас","Васкес","Вега","Веласко","Винсенте", ];
const GE_Surnames_RU = [ /* Таблица людских German фамилий */
    "Беккер", "Бауэр", "Браун", "Браунфельс", "Болдуин",
    "Кох", "Крюгэр", "Кулэр", "Кляйн", "Крузе", "Гюнтэр",
    "Хоффманн", "Хартманн", "Ханн", "Габсбург", "Германн",
    "Фишер", "Гарисон", "Айхенвальд", "Фюрстенберг",
    "Лейманн", "Ланге", "Люксембург",
    "Мюллэр", "Мейер", "Маендорф",
    "Рихтэр", "Ньюман", "Пэтэрс", "Тиль",
    "Шнайдэр", "Шредер", "Шультц", "Шмидт", "Шэйфэр", "Швартц",
    "Вагнэр", "Вэбэр", "Вэрнэр", "Вайс", "Вульф", "Цимэрманн"];
const GE_Noblesse = [GE_Noblesse_EN, [ //* Немецких аристократических фамилий */
    "Альбедил", "Штатхэльбэрг", "Рэнэнкампф", "Кальтэнбрунэр", "Хасэнклевер", "Винтэрхальтэр",
    "Билдэрлинг", "Райхэнбах", "Оттинэр", "Этингер", "Глассенапп", "Лампрехт",
    "Ратценбергер", "Кли", "Бааде", "Калленберг", "Каль", "Таппэрт", ],];
const FR_Surnames_RU = [ /* Таблица людских французских фамилий */
    "Мишэль", "Пьерр", "Томас", "Роберт", "Ричард", "Лоран", "Бертранд", "Бернард",
    "Легранд", "Моро", "Ру", "Леру", "Босью", "Орей",
    "Франс", "Паризо", "Депардье", "Лангле", "Дюпон",
    "Монье", "Миттеран", "Фурнье", "Булонже",
    "Дюран", "Морель", "Жирар", "Дюруа", "Дюваль", "Дюбуа", ];
const FR_Noblesse = [FR_Noblesse_EN, [ /* Таблица аристократических французских фамилий */
    "дэ Буфрэмон", "дэ Буфремон Бефорт-Спонтан", "дэ Бово-Краон", "дэ Бютин", "Блакас д'Ульп",
    "дэ Кайлус", "дэ Кайлус-Руж", "дэ Коссе-Бриссак", "дэ Бройль", "дэс Кар",
    "дэ Клермон-Тоннер", "дэ Грамон", "дэ Харкорт", "дэ Комон Ла Форс", "дэ ла Рушфуко",
    "Дюрфорт Сиврак дэ Лорж", "дэ Люсинг", "дэ Люинс", "Майе де ла Тур-Ландри", "дэ Менье",
    "дэ Мерод", "дэ Мортмарт", "дэ Ноаль", "дэ Полиньяк", "дэ Праслин",
    "Рарéкорт Ла-Валле-де-Пимодан", "Рике Караман-Чимай", "дэ Рохан-Рохан", "дэ Рохан-Шабо", "дэ Сабран-Понтевес",
    "Криссоль д'Узэс", ],];
const PL_Surnames_RU = [ /* Таблица людских польских фамилий */
    "Новак", "Ковальски", "Вишневски", "Войцик", "Ковальчик",
    "Камински", "Левандовски", "Зелински", "Шимански", "Возняк", "Дабровски",
    "Янковски", "Мазур", "Войцеховски", "Квятковски", "Кравчик", "Качмарэк",
    "Мадэй", "Пётровски", "Грабовски",
    "Зaрэмба", "Пухaла", "Пшибыла",
    "Плуг", "Фертиг", "Шелиг",];
const VE_Surnames_RU = [ /* Таблица людских скандинавских фамилий */
    "Абрамссон", "Адамссон", "Альбертссон", "Андэрссон", "Атченссон", "Бенссон",
    "Чальзсон", "Давидссон", "Дикинссон", "Добссон", "Дональдссон", "Дайссон",
    "Эндэрссон", "Эрикссон", "Фаргюссон", "Гарриссон", "Гилссон", "Гимссон",
    "Харриссон", "Якобссон", "Джонссон", "Мэйссон", "Майкельссон",
    "Морриссон", "Метьюссон", "Нельссон", "Никольссон", "Паркинссон", "Парссон", "Патэрссон", "Петерссон",
    "Робинссон", "Симссон", "Стивенссон", "Томпссон", "Ватссон", "Вилссон", "Вилкинссон", ];
const VO_Surnames_RU = [ /* Таблица людских итальянских фамилий */
    "Аллегро",
    "Барбаросса", "Барбэри", "Бонмарито", "Боттичелли", "Бруно", "Бруни", "Буджардини", "Бьянчи",
    "Кавалли", "Карбонэ", "Коломбо", "Контэ",
    "Эспосито",
    "Феррари", "Ферраро", "Фэрари", "Финоккио", "Фумагалли",
    "Джудичи", "Гуэрра", "Гирландайо", "Грассо", "Джэнтиле",
    "Инганнамортэ",
    "Манчини", "Марио", "Мэдичи", "Морэти", "Мориарди", "Морритт",
    "Нэри",
    "Пелагатти", "Пеларатти", "Пеллегрини", "Понтэдра",
    "Кватрокки",
    "Риччи", "Риччи", "Риззо", "Романо", "Росси", "Руссо",
    "Сальтаформайо", "Сатро", "Сэрра", "Скварчалупи",
    "Торрегросса", ];
const VO_Noblesse = [VO_Noblesse_EN, [ /* Таблица аристократических итальянских фамилий */
    "дʼАльдобранчини", "дʼАкорамбони", "дʼАсти", "ди Барберини", "ди Боргэзэ",
    "дэль Карретто", "ди Каппони", "ди Караффа", "ди Ориоло", "Амато ди Каччамо",
    "ди Натоли", "ди Одескальки", "ди Памфили", "ди Пикколоминиi", "Амато ди Шакка",
    "Таон ди Рэвэль", "дʼИсолани", "ди Канэваро", "ди Карпони", "Менабрея ди Валь-Дора",
    "ди Салина", "ди Бароцци", "ди Дайнезэ", "Капидзуки ди Кассин ди Страда", "ди Паулуччи",
    "ди Санти", "ди Флорио", "ди Помбино", "ди Салерно", "ди Таранто", "ди Гуиджи",
    "ди Маркони", "дʼЭстэ", "дʼАвогадро", "дʼАкколти", "ди Ногарола", "ди Гуаско",
    "дель Васто", "ди Тосси", "ди Коллалто", "ди Колоредо", "ди Мансини", "ди Маттэй", ],];
const CR_Surnames_RU = [ /* Таблица людских мусульманских фамилий */
    "Аббас", "Абдалла", "Афзал", "Ахмед", "Акель", "Акхтар", "Аман", "Амир", "Аталла", "Азиз",
    "Бади", "Баиг", "Бари", "Башир", "Бегум", "Бешара", "Билал",
    "Дада", "Даллал", "Дар", "Дарвиш", "Дин", "Дуд",
    "Эбрахим", "Эид", "Элаим", "Эльбаз", "Эмани",
    "Фадэль", "Фарай", "Фахра", "Фарух", "Фарран", "Фаваз", "Фирман",
    "Джабель", "Гаффари", "Гахем",
    "Хабиб", "Хади", "Хафиз", "Хаи", "Хаидар", "Хаким", "Халлал", "Хамдам", "Хана", "Хак",
    "Харири", "Харрун", "Хасан", "Хашим",
    "Миан", "Мина", "Минхас", "Мизра", "Митри", "Мохамад", "Мухиддин", "Мона", "Мухаммад", "Мустафа",
    "Наги", "Насир", "Ниази",
    "Обейд", "Одэх", "Омар", "Оттам", "Озэр",
    "Парса", "Пуор",
    "Кадир", "Касим",
    "Раад", "Раббани", "Ради", "Рафик", "Рахман", "Рахим",
    "Сааб", "Саадэх", "Салаам", "Салик", "Салман", "Саед", "Шакир",
    "Тамер", "Тарик",
    "Уддин",
    "Вазири", "Вохра",
    "Вахаб", "Ваххид", "Вали",
    "Ямин", "Юсуф",
    "Задэх", "Захра", "Зиа",  ];
const JD_Surnames_RU = [ /* Таблица людских иудейских фамилий */
    "Аронсон", "Абельман", "Абрам", "Акэр", "Адельман", "Аппельбаум",
    "Бах", "Беккэр", "Беновиц", "Беренсон", "Берг", "Бинг", "Блау",
    "Кохэн", "Куперман",
    "Давид", "Даймонд", "Диллон", "Дрэйфус", "Друкэр",
    "Эккэр", "Эдэльман", "Эфрон", "Эрлрич", "Эйстэйн", "Элкаим", "Элкин", "Эзра",
    "Фабрикант", "Фаирман", "Фальк", "Фэйн", "Фэйенбаум", "Фэйберг", "Фирман",
    "Гарфникель", "Гельб", "Гельбер", "Гэллэр", "Гирсбэрг", "Гласэр", "Глик", "Голд",
    "Хаим", "Хэлперт", "Гамбург", "Хелбэрг", "Хэллэр", "Химэль", "Хирш", "Хаят",
    "Исаак", "Израэль", "Яблонкий", "Янович",
    "Кэйн", "КАплан", "Кац", "КАуфман", "Кемпбел", "Килман", "Клейнфилд", "Кнопп",
    "Лахман", "Ландман", "Люберстэйн", "Лехер", "Лэйб", "Лихтман", "Леви", "Левин",
    "Магид", "Мальцман", "Маогулис", "Меламед", "Мехлэр", "Мэндэльсон", "Мейер", "Миндэль",
    "Нахт", "Нернберг", "Нудель",
    "Оберман", "Ортман", "Ошэр", "Остров",
    "Перльман", "Поланский", "Портной",
    "Рабин", "Рабинович", "Рэйман", "Рэйдэл", "Ривлин", "Розэнбаум", "Розенкранц", "Рот",
    "Сакс", "Сакман", "Саган", "Салцбург", "Сандлер", "Сапэрстэйн", "Сас", "Сассон",
    "Талман", "Таннэнбаум", "Тилман", "Труман", "Тёрнэр",
    "Ухр", "Улман",
    "Вогель",
    "Воллес", "Вэйнер", "Вэйнрих", "Вэйсс", "Винтэрстэйн", "Вольхберг",
    "Якель", "Ямпольский", "Юркович",
    "Залман", "Зейчман", "Зион", "Зив", "Цукэрберг", "Цукерман", "Зур",  ];
const CT_Surnames_RU = [ /* Таблица людских китайских фамилий */
    "Ванг", "Ли", "Жанг", "Лиу", "Чен", "Янг", "Хуанг", "Жао", "Жоу",
    "Ху", "Сун", "Ма", "Жу", "Ху", "Гуо", "Хи", "Лин", "Гао", "Луо",
    "Жен", "Лианг", "Хие", "Сонг", "Танг", "Ху", "Денг", "Ханг", "Хенг", "Сяо",
    "Пенг", "Зенг", "Ксяо", "Тиан", "Донг", "Пан", "Ян", "Сай", "Йянг", "Йю",
    "Ду", "Йе", "Ченг", "Вэй", "Су", "Лу", "Динг", "Рэн",
    "Яо", "Шэн", "Жонг", "Янг", "Суи", "Тан", "Ванг", "Фан", "Лиао",
    "Ши", "Джин", "Вэй", "Джиа", "Ксиа", "Фу", "Фанг", "Жоу", "Ксёнг", "Бай",
    "Тан", "Ксин", "Киу", "Хоу", "Джанг", "Йин", "Ксю", "Ян", "Лей", "Лонг",
    "Ли", "Ши", "Тао", "Хи", "Мао", "Дуан", "Хао", "Гу", "Гонг", "Шао",
    "Ксин", "Ву", "Ксин", "Дай", "Йан", "Мо", "Конг", "Ксянг", "Чанг", "Танг",  ];

const Surnames_RU = ["Random", EN_Surnames_RU, SC_Surnames_RU, IR_Surnames_RU, SP_Surnames_RU,
                  GE_Surnames_RU, FR_Surnames_RU, PL_Surnames_RU, RU_Surnames, VE_Surnames_RU,
                  VO_Surnames_RU, CR_Surnames_RU, JD_Surnames_RU, CT_Surnames_RU, ];
const Surnames = [Surnames_EN, Surnames_RU, ];

// перевод свойств персонажа //
const lang_Strength = [["Strength", "Influence",], ["Сила", "Влияние",],]
const lang_Arcana = [["Arcana", "Virtue", "Hubris",], ["Тайна",  "Добродетель", "Порок",],]
const tbl_Virtue = [tbl_EN_Virtue,
   ["Глупец, хитрый", "Дорога, дружелюбный", "Маг, своенравный",
    "Влюбленные, страстный", "Колесо, удачливый", "Дьявол, коварный",
    "Башня, скромный", "Нищий, проницательный", "Ведьма, интуитивная",
    "Война, победоносная", "Повешенный, альтруистический", "Монеты (для Возницы), адаптивный",
    "Престолы, утешительный", "Безлунная Ночь, утонченная", "Солнце, прославное",
    "Пророк, озаряющий", "Воссоединение, образцовый", "Герой, отважный",
    "Символ, умеренный", "Император, властный",],];
const tbl_Hubris = [tbl_EN_Hubris,
   ["Глупец, любопытный", "Дорога, неуверенный", "Маг, амбициозный",
    "Влюбленные, перекрещенные звезды", "Колесо, невезучий", "Дьявол, доверчивый",
    "Башня, высокомерный", "Нищая, завистливая", "Ведьма, манипулятивная",
    "Война, верная", "Повешенный, нерешительный", "Монеты (для Возницы), неумолимый",
    "Престолы, упрямый", "Безлунная ночь, замешательство", "Солнце, гордый",
    "Пророк, гипер-усердный", "Воссоединение, горестный", "Герой, безрассудный",
    "Символ, суеверный", "Император, вспыльчивый",],];
